Autodesk.Revit.DB.BaseImportOptions.Unit
The unit of measure for imported geometry.
Remarks:
Units are used to calculate the import scale unless scale is defined explicitly using CustomScale, in which case Units will be ignored.
Feet, inches, meters, centimeters, decimeters, millimeters are all supported. If Default unit is set, Revit will read and use the units
from the file. If units are not available or accessible there, or if the file contains multiple length units, the data will be imported
at the original scale regardless of the unit and default length unit options.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013